let handler = async (m, { conn, usedPrefix, command, text }) => {
const tools = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
﹝• م1 •﹞      *الــرومــات* 🪶
﹝• م2 •﹞      *قــســم الــديــن الاســلامــي* 📿
﹝• م3 •﹞      *قــســم الــتــرفــيــه* 🕹     
﹝• م4 •﹞      *قــســم التــنزيــلات* 🛡
﹝• م5 •﹞      *قــســم التــحــويــلات* 🌀
﹝• م6 •﹞      *قــســم الـمطـور فـقط* 👑
﹝• م7 •﹞       *كــل الاوامــــر*
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
*لا تنسى النقطه لطلب القسم اكتب نقطه و م*
*لكى تعرف المطور اكتب نقطه سورس*
*الــــمطــــور بــــــلاڪ بــــيــحــــبــڪ*
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓
𝐁𝐋𝐀𝐂𝐊-𝐵𝛩𝑇ᥬ🌚᭄
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`; 
const group = `⟣┈┈┈┈┈┈⟢〘❄〙⟣┈┈┈┈┈┈┈⟢
         *༺ قــســم الـأداوات ༻*
⟣┈┈┈┈┈┈⟢〘❄〙⟣┈┈┈┈┈┈┈⟢
│✯ ❯ .كومنت. 
│✯ ❯ .جوده. 
│✯ ❯ .زخرف. 
│✯ ❯ .كود. 
│✯ ❯ .ترجمه. 
│✯ ❯ .فيك. 
│✯ ❯ .دحيح.   〘 ذكاء اصطناعي يقرا الصور ايضا 〙
│✯ ❯ . شوف.  〘 نفس الشئ 〙
│✯ ❯ .انطق. 
         *⟣𓆩༺ 𝒁𝒆𝒛𝒐 𝑩𝒐𝒕 ༻𓆪⟢*`; 

const messages = [[ 
tools, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/f4f9d2420ac2b1072eb2e.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
group, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/f4f9d2420ac2b1072eb2e.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
]]
await conn.sendCarousel(m.chat,`مرحبا ${m.pushName}`, 'هذه هيا قوائم البوت', `القائمه`, messages, m)            

}
handler.command = /^(ترو)$/i
export default handler
