let handler = async (m, { conn, usedPrefix, command, text }) => {
const group = `⟣┈┈┈┈┈┈⟢〘❄〙⟣┈┈┈┈┈┈┈⟢
      *༺ قــســم الـجـروب ༻*
⟣┈┈┈┈┈┈⟢〘❄〙⟣┈┈┈┈┈┈┈⟢
│✯ ❯ .انذار                         
│✯ ❯ .الغاءالانذار.               
│✯ ❯ .الانذارات.                 
│✯ ❯ .دعوه.                      
│✯ ❯ .منشن.                     
│✯ ❯ .مخفي.  
│✯ ❯ .ضيف 〘 لا تستخدم هذا الامر كثيرا حتي لا يحظر رقم البوت〙                  
│✯ ❯ .المشرفين.                
│✯ ❯ .جروب.                    
│✯ ❯ .طرد.   
│✯ ❯ .الارقام + رمز الدوله
>  〘 يعطيك قائمة الارقام البادئه برمز الدوله 〙    
│✯ ❯ .طرد_الارقام.
> 〘 يطردلك كل الارقام برمز الدوله 〙                
│✯ ❯ .رستر.                      
│✯ ❯ .حذف.                    
│✯ ❯ .واتس.                     
│✯ ❯ .لينك.                      
│✯ ❯ .تغيرالترحيب.           
│✯ ❯ .تغيرالوداع. 
│✯ ❯ .رفع. 
│✯ ❯ .خفض. 
│✯ ❯ .تغير-الاسم. 
│✯ ❯ .تغيرالوصف. 
│✯ ❯ .تغيرالصوره. 
              *⟣𓆩༺ 𝒁𝒆𝒛𝒐 𝑩𝒐𝒕 ༻𓆪⟢*`; 
const tools = `⟣┈┈┈┈┈┈⟢〘❄〙⟣┈┈┈┈┈┈┈⟢
         *༺ قــســم الـأداوات ༻*
⟣┈┈┈┈┈┈⟢〘❄〙⟣┈┈┈┈┈┈┈⟢
│✯ ❯ .كومنت. 
│✯ ❯ .جوده. 
│✯ ❯ .زخرف. 
│✯ ❯ .كود. 
│✯ ❯ .ترجمه. 
│✯ ❯ .فيك. 
│✯ ❯ .دحيح.   〘 ذكاء اصطناعي يقرا الصور ايضا 〙
│✯ ❯ . شوف.  〘 نفس الشئ 〙
│✯ ❯ .انطق. 
         *⟣𓆩༺ 𝒁𝒆𝒛𝒐 𝑩𝒐𝒕 ༻𓆪⟢*`; 

const messages = [[ 
group, 
'𝒁𝒆𝒛𝒐 𝑩𝒐𝒕',
'https://telegra.ph/file/f4f9d2420ac2b1072eb2e.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029Vaflefp4Y9ljqmqllP3a']]
], [
tools, 
'𝒁𝒆𝒛𝒐 𝑩𝒐𝒕',
'https://telegra.ph/file/f4f9d2420ac2b1072eb2e.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
]]
await conn.sendCarousel(m.chat,`مرحبا ${m.pushName}`, 'هذه هيا قوائم البوت', `القائمه`, messages, m)            

}
handler.command = /^(ترو)$/i
export default handler
