let handler = async (m, { conn, usedPrefix, command, text }) => {
const tools = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
   🪶*كــــل القــوائــم*🪶
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓   
﹝• م1 •﹞      *الــرومــات* 🪶
﹝• م2 •﹞      *قــســم الــديــن الاســلامــي* 📿
﹝• م3 •﹞      *قــســم الــتــرفــيــه* 🕹     
﹝• م4 •﹞      *قــســم التــنزيــلات* 🛡
﹝• م5 •﹞      *قــســم التــحــويــلات* 🌀
﹝• م6 •﹞      *قــســم الـمطـور فـقط* 👑
﹝• م7 •﹞       *كــل الاوامــــر*
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓
*لا تنسى النقطه لطلب القسم اكتب نقطه و م*
*لكى تعرف المطور اكتب نقطه سورس*
*الــــمطــــور بــــــلاڪ بــــيــحــــبــڪ*
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓
𝐁𝐋𝐀𝐂𝐊-𝐵𝛩𝑇ᥬ🌚᭄
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`; 
const group = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
الــرومــات 🪶
⽗𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓⽗
𝐁𝐋𝐀𝐂𝐊-𝐵𝛩𝑇👑
⽗𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓⽗
﹝🝓 ضيف 🝓﹞
﹝🝓 الاشباح 🝓﹞
﹝🝓 طرد 🝓﹞
﹝🝓 منشني 🝓﹞
﹝🝓 ترقيه 🝓﹞
﹝🝓 اعفاء 🝓﹞
﹝🝓 انذار 🝓﹞
﹝🝓 حذف_انذار 🝓﹞
﹝🝓 حذف 🝓﹞
﹝🝓 منشن 🝓﹞
﹝🝓 عملات 🝓﹞
﹝🝓 مخفي 🝓﹞
﹝🝓 المشرفين 🝓﹞
﹝🝓 بروفايل 🝓﹞
﹝🝓 الجروب 🝓﹞
﹝🝓 دعوه 🝓﹞
﹝🝓 تغيير_اللينك 🝓﹞
﹝🝓 لفل 🝓﹞
﹝🝓 جروب 🝓﹞
﹝🝓 جروب فتح 🝓﹞
﹝🝓 جروب قفل 🝓﹞
﹝🝓 خط 🝓﹞
﹝🝓 توب 🝓﹞
﹝🝓 لينك 🝓﹞
﹝🝓 يومي 🝓﹞
﹝🝓 الماس 🝓﹞
﹝🝓 ترتيب_البنك 🝓﹞
﹝🝓 شراء 🝓﹞
﹝🝓 هجوم 🝓﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓
𝐁𝐋𝐀𝐂𝐊-𝐵𝛩𝑇ᥬ🌚᭄
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`; 
const p2 = `⽗𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓⽗
قــســم الــديــن الاســلامــي 📿
𓅓 ⋅ ───━ •﹝🪶﹞• ━─── ⋅ 𓅓 
﹝✿ سورة ✿﹞
﹝✿ حديث ✿﹞
﹝✿ قران ✿﹞
﹝✿ الله ✿﹞
﹝✿ ايات ✿﹞
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓
𝐁𝐋𝐀𝐂𝐊-𝐵𝛩𝑇ᥬ🌚᭄
𓅓 ⋅ ───━ •﹝👑﹞• ━─── ⋅ 𓅓`;
   
const messages = [[ 
tools, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/0fdcdc9bec8508976d5e9.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
group, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/0fdcdc9bec8508976d5e9.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
], [
p2, 
'𝐵𝐿𝐴𝐶𝐾 𝐵𝛩𝑇',
'https://telegra.ph/file/0fdcdc9bec8508976d5e9.jpg',
[['', '']],[],[['قناتي','https://whatsapp.com/channel/0029VacWb364dTnEKmVWd628']]
]] 
await conn.sendCarousel(m.chat,`مرحبا ${m.pushName}`, 'هذه هيا قوائم البوت', `قــســم`, messages, m)            

}
handler.command = /^(ترو)$/i
export default handler
